import os

folders = [
    "Набор задач 13 (2023.02.01)",
    "Набор задач 14 (2023.02.15)",
    "Набор задач 15 (2023.03.10)",
    "Набор задач 16 (2023.03.24)",
    "Набор задач 17 (2023.04.05)",
    "Набор задач 18 (2023.04.19)",
    "Набор задач 12 (2022.12.17)",
    "Набор задач 11 (2022.12.10)",
    "Набор задач 10 (2022.11.26)",
    "Набор задач 9 (2022.11.12)",
    "Набор задач 8 (2022.10.22)",
    "Набор задач 7 (2022.10.15)",
    "Набор задач 6 (2022.10.08)",
    "Набор задач 5 (2022.10.01)",
    "Набор задач 4 (2022.09.24)",
    "Набор задач 3 (2022.09.17)",
    "Набор задач 2 (2022.09.10)",
    "Набор задач 1 (2022.09.03)"
]

for folder in folders:
    folder_name = folder.replace("[правила ICPC]", "").strip()
    os.makedirs(folder_name, exist_ok=True)
